In [3]:
import pandas as pd
import os 
import csv
import numpy as np
# import numpy as 
purchase_data = "Resources/purchase_data.csv"

purchase_data = pd.read_csv(purchase_data)

In [4]:
purchase_data_df = pd.DataFrame(purchase_data)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [5]:
# removing any missing data, Ceci helped me find the function to use here
player_demographics = purchase_data.loc[:,["Gender", "SN", "Age"]]
player_demographics

     Gender             SN  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
775  Female     Aethedru70   21
776    Male         Iral74   21
777    Male     Yathecal72   20
778    Male        Sisur91    7
779    Male      Ennrian78   24

[780 rows x 3 columns]

In [6]:
player_demographics = player_demographics.drop_duplicates() 
player_demographics

     Gender             SN  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
773    Male         Hala31   21
774    Male     Jiskjask80   11
775  Female     Aethedru70   21
777    Male     Yathecal72   20
778    Male        Sisur91    7

[576 rows x 3 columns]

In [7]:
num_players = len(player_demographics["SN"].unique())
num_players

576

In [48]:
total_players = pd.DataFrame([{
    "Total players": num_players
}])
total_players.head()

   Total players
0            576

In [9]:
unique_items = len(purchase_data["Item Name"].unique())
unique_items

179

In [10]:
 average = purchase_data_df["Price"].mean()
average

3.050987179487176

In [11]:
sales = purchase_data_df["Price"].sum()
sales

2379.77

In [255]:
Unique_item = pd.DataFrame([{
    "Number of unique items": unique_items,
    "Average Price": average,
    "Number of purchases": num_players,
    "Total Revenue":sales,
}])

Unique_item.style.format({'Average Price':"${:,.2f}"})

In [13]:
gender_total = player_demographics['Gender'].value_counts()
gender_total

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [14]:
player_demographics = player_demographics.drop_duplicates() 
player_demographics

     Gender             SN  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
773    Male         Hala31   21
774    Male     Jiskjask80   11
775  Female     Aethedru70   21
777    Male     Yathecal72   20
778    Male        Sisur91    7

[576 rows x 3 columns]

In [15]:
gender_counts_df = pd.DataFrame(gender_total)
gender_counts_df.head()

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [16]:
per_player = (gender_counts_df / gender_counts_df.sum()) * 100
per_player.head()

                          Gender
Male                   84.027778
Female                 14.062500
Other / Non-Disclosed   1.909722

In [17]:
gender_stat_df = pd.DataFrame({
    "Total Count":gender_total,
    "Percentage of Players":per_player['Gender']
    })
gender_stat_df.head()

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [60]:
total_play = len(purchase_data['Gender'])
total_play

780

In [19]:
gender2 = purchase_data_df['Gender'].value_counts()
gender2.head()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [20]:
gender_averages = purchase_data_df[["Gender", "Price"]]
gender_averages.head()

  Gender  Price
0   Male   3.53
1   Male   1.56
2   Male   4.88
3   Male   3.27
4   Male   1.44

In [21]:
average_group = gender_averages.groupby(["Gender"]).mean()
average_groups_df = average_group["Price"]
average_groups_df

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [22]:
average_group = gender_averages.groupby(["Gender"]).sum()
average_price_df = average_group["Price"]
average_price_df

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [23]:
average_perchace = average_price_df / gender_total
average_perchace

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [24]:
gender_stat_df = pd.DataFrame({
    "Total Count":gender_total,
    "Percentage of Players":per_player['Gender']
    })
gender_stat_df.head()

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [267]:
gen_analysis = pd.DataFrame({"Purchase count":gender2,
                             "Average Purchase Price":average_groups_df,
                             "Total Purchase Volume":average_price_df,
                             "Avg Total Per Person":average_perchace })

gen_analysis.index.name = "Gender"

gen_analysis.style.format({'Average Purchase Price':"${:,.2f}",
                          'Total Purchase Volume':"${:,.2f}",
                          'Avg Total Per Person':"${:,.2f}"})

In [29]:
# age['age'] = pd.cut(x=age['age'], bins=[0, 9, 14, 19, 24 , 29, 34 , 39, 44, 49], labels=)
# age

In [30]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 9999]
group_labels = ["<10", "10 to 14", "15 to 19", "20 to 24", "25 to 29", "30 to 34", "35 to 39", "40>"]

In [74]:
player_demographics["Ages Ranges"] = pd.cut(player_demographics["Age"], bins, labels=group_labels)
player_demographics
# Purchase data rename

     Gender             SN  Age Ages Ranges Purchase Count  Purchase
0      Male        Lisim78   20    20 to 24       20 to 24  20 to 24
1      Male    Lisovynya38   40         40>            40>       40>
2      Male     Ithergue48   24    20 to 24       20 to 24  20 to 24
3      Male  Chamassasya86   24    20 to 24       20 to 24  20 to 24
4      Male      Iskosia90   23    20 to 24       20 to 24  20 to 24
..      ...            ...  ...         ...            ...       ...
773    Male         Hala31   21    20 to 24       20 to 24  20 to 24
774    Male     Jiskjask80   11    10 to 14       10 to 14  10 to 14
775  Female     Aethedru70   21    20 to 24       20 to 24  20 to 24
777    Male     Yathecal72   20    20 to 24       20 to 24  20 to 24
778    Male        Sisur91    7         <10            <10       <10

[576 rows x 6 columns]

In [32]:
group_by_age = player_demographics.groupby("Ages Ranges")

In [33]:
age_cout = group_by_age["Age"].count()
age_cout

Ages Ranges
<10          17
10 to 14     22
15 to 19    107
20 to 24    258
25 to 29     77
30 to 34     52
35 to 39     31
40>          12
Name: Age, dtype: int64

In [34]:
age_perct = (age_cout / num_players) * 100
age_perct

Ages Ranges
<10          2.951389
10 to 14     3.819444
15 to 19    18.576389
20 to 24    44.791667
25 to 29    13.368056
30 to 34     9.027778
35 to 39     5.381944
40>          2.083333
Name: Age, dtype: float64

In [263]:
age_frame = pd.DataFrame({"Total Count":age_cout,
                             "Percentage of players":age_perct,
})
age_frame.index.name = None
age_frame.style.format({'Percentage of players':"{:,.2f}"})

In [36]:
# do next on purchase data

In [101]:
player_og = purchase_data.loc[:,["Gender", "SN", "Age", "Price", "Purchase ID"]]
player_og

     Gender             SN  Age  Price  Purchase ID
0      Male        Lisim78   20   3.53            0
1      Male    Lisovynya38   40   1.56            1
2      Male     Ithergue48   24   4.88            2
3      Male  Chamassasya86   24   3.27            3
4      Male      Iskosia90   23   1.44            4
..      ...            ...  ...    ...          ...
775  Female     Aethedru70   21   3.54          775
776    Male         Iral74   21   1.63          776
777    Male     Yathecal72   20   3.46          777
778    Male        Sisur91    7   4.19          778
779    Male      Ennrian78   24   4.60          779

[780 rows x 5 columns]

In [102]:
num_player = (player_og["SN"].count())
num_player

780

In [103]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 9999]
group_labels = ["<10", "10 to 14", "15 to 19", "20 to 24", "25 to 29", "30 to 34", "35 to 39", "40>"]

In [145]:
player_og["Age Ranges"] = pd.cut(purchase_data["Age"], bins, labels=group_labels)
player_og

     Gender             SN  Age  Price  Purchase ID  Purchase Age Ranges
0      Male        Lisim78   20   3.53            0  20 to 24   20 to 24
1      Male    Lisovynya38   40   1.56            1       40>        40>
2      Male     Ithergue48   24   4.88            2  20 to 24   20 to 24
3      Male  Chamassasya86   24   3.27            3  20 to 24   20 to 24
4      Male      Iskosia90   23   1.44            4  20 to 24   20 to 24
..      ...            ...  ...    ...          ...       ...        ...
775  Female     Aethedru70   21   3.54          775  20 to 24   20 to 24
776    Male         Iral74   21   1.63          776  20 to 24   20 to 24
777    Male     Yathecal72   20   3.46          777  20 to 24   20 to 24
778    Male        Sisur91    7   4.19          778       <10        <10
779    Male      Ennrian78   24   4.60          779  20 to 24   20 to 24

[780 rows x 7 columns]

In [146]:
group_by_purchase = player_og.groupby("Age Ranges")

In [147]:
age_ct = group_by_purchase["Age"].count()
age_ct

Age Ranges
<10          23
10 to 14     28
15 to 19    136
20 to 24    365
25 to 29    101
30 to 34     73
35 to 39     41
40>          13
Name: Age, dtype: int64

In [175]:
ag_ct = group_by_purchase["SN"].nunique()
ag_ct

Age Ranges
<10          17
10 to 14     22
15 to 19    107
20 to 24    258
25 to 29     77
30 to 34     52
35 to 39     31
40>          12
Name: SN, dtype: int64

In [151]:
ave_pur = player_og[["Age", "Price", "Age Ranges", "Gender"]]
ave_pur

     Age  Price Age Ranges  Gender
0     20   3.53   20 to 24    Male
1     40   1.56        40>    Male
2     24   4.88   20 to 24    Male
3     24   3.27   20 to 24    Male
4     23   1.44   20 to 24    Male
..   ...    ...        ...     ...
775   21   3.54   20 to 24  Female
776   21   1.63   20 to 24    Male
777   20   3.46   20 to 24    Male
778    7   4.19        <10    Male
779   24   4.60   20 to 24    Male

[780 rows x 4 columns]

In [155]:
gender_average = player_og[["Age", "Price", "Age Ranges", "Gender"]]
gender_average.head()

   Age  Price Age Ranges Gender
0   20   3.53   20 to 24   Male
1   40   1.56        40>   Male
2   24   4.88   20 to 24   Male
3   24   3.27   20 to 24   Male
4   23   1.44   20 to 24   Male

In [156]:
ave_grp = gender_average.groupby(["Age Ranges"]).mean()
ave_df = ave_grp["Price"]
ave_df

Age Ranges
<10         3.353478
10 to 14    2.956429
15 to 19    3.035956
20 to 24    3.052219
25 to 29    2.900990
30 to 34    2.931507
35 to 39    3.601707
40>         2.941538
Name: Price, dtype: float64

In [202]:
average_group = gender_average.groupby(["Age Ranges"]).sum()
price = average_group["Price"]
price

Age Ranges
<10           77.13
10 to 14      82.78
15 to 19     412.89
20 to 24    1114.06
25 to 29     293.00
30 to 34     214.00
35 to 39     147.67
40>           38.24
Name: Price, dtype: float64

In [ ]:
ave_pt = gender_average.groupby(["Age"]).mean()
ave = ave_grp[""]
ave

In [176]:

ave =  price/ag_ct 
ave

Age Ranges
<10         4.537059
10 to 14    3.762727
15 to 19    3.858785
20 to 24    4.318062
25 to 29    3.805195
30 to 34    4.115385
35 to 39    4.763548
40>         3.186667
dtype: float64

In [266]:
pruchase_analysis = pd.DataFrame({"Purchas Count":age_ct,
                             "Average Purchase Price":ave_df,
                                  "Total Purchase Value":price,
                                  "Avg Total Purchase per Person":ave
})
pruchase_analysis.style.format({'Average Purchase Price':"${:,.2f}",
                               'Total Purchase Value':"${:,.2f}",
                               'Avg Total Purchase per Person':"${:,.2f}"})

In [248]:
pur_ct = purchase_data.groupby("SN")

In [217]:
sn_ave = pur_ct["Purchase ID"].count()
sn_ave

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [219]:
av_sn = pur_ct["Price"].mean()
av_sn

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [220]:
tt_sn = pur_ct["Price"].sum()
tt_sn

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [222]:
Top_sn = pd.DataFrame({"Purchase Count":sn_ave,
                       "Average Purchase Price":av_sn,
                       "Total Purchase Value":tt_sn
    
})
Top_sn.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [271]:
formmatted_top_items = Top_sn.sort_values(["Total Purchase Value"], ascending=False).head()
formmatted_top_items.style.format({'Average Purchase Price':"${:,.2f}",
                           'Total Purchase Value':"${:,.2f}"})

In [227]:
popular = purchase_data[["Item ID", "Item Name", "Price"]]
popular

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [231]:
pop_stat = popular.groupby(["Item ID", "Item Name"])

In [233]:
pop_count = pop_stat["Price"].count()
pop_count

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Price, Length: 179, dtype: int64

In [234]:
itm_pr = (pop_stat["Price"].sum())
itm_pr

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [240]:
itm_vol = itm_pr / pop_count
itm_vol

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [245]:
popular_items = pd.DataFrame({"Purchase Count":pop_count,
                              "Item Price":itm_vol,
                              "Total Purchase Value":itm_pr
    
})
popular_items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.2800,5.12
1,Crucifer,4,2.9425,11.77
2,Verdict,6,2.4800,14.88
3,Phantomlight,6,2.4900,14.94
4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
181,Reaper's Toll,5,1.6600,8.30
182,Toothpick,3,4.0300,12.09
183,Dragon's Greatsword,3,1.0900,3.27

In [269]:
formmatted_popular = popular_items.sort_values(["Purchase Count"], ascending=False).head()
formmatted_popular.style.format({'Item Price':"${:,.2f}",
                           'Total Purchase Value':"${:,.2f}"})